#  n : 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22
#f(n): 1  2  1  4  1  2  1  8  1  2  1  4  1  2  1 16  1  2  1  4  1  2
# 2^0: 0  1  0  3  0  1  0  7  0  1  0  3  0  1  0 15  0  1  0  3  0  1 <- 2^0마다 2^0빼기

# 2^1: 0  0  0  2  0  0  0  6  0  0  0  2  0  0  0 14  0  0  0  2  0  0 <- 2^1마다 2^0빼기
# 2^2: 0  0  0  0  0  0  0  4  0  0  0  0  0  0  0 12  0  0  0  0  0  0 <- 2^2마다 2^1빼기
# 2^3: 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  8  0  0  0  0  0  0 <- 2^3마다 2^2빼기
# 2^4: 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 <- 2^4마다 2^3빼기

import sys
input = sys.stdin.readline

def s(n):
    ret = n

    gap = 2  # 간격, 2^1
    add = 1  # 더할 값, 2^0
    while True:
        ret += (n//gap)*add
        gap, add = gap*2, add*2
        if gap > n:
            break
    return ret

A, B = map(int, input().split())
print(s(B) - s(A-1))
